In [1]:
import pandas as pd

### read files

In [2]:
data = pd.read_csv('melb_data.csv')

data

,Unnamed: 0,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.79960,144.99840,Northern Metropolitan,4019.0
1,2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.80790,144.99340,Northern Metropolitan,4019.0
2,4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.80930,144.99440,Northern Metropolitan,4019.0
3,5,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.79690,144.99690,Northern Metropolitan,4019.0
4,6,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.80720,144.99410,Northern Metropolitan,4019.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18391,23540,Williamstown,8/2 Thompson St,2,t,622500.0,SP,Greg,26/08/2017,6.8,...,2.0,1.0,NaN,89.0,2010.0,NaN,-37.86393,144.90484,Western Metropolitan,6380.0
18392,23541,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,...,1.0,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0
18393,23544,Yallambie,17 Amaroo Wy,4,h,1100000.0,S,Buckingham,26/08/2017,12.7,...,3.0,2.0,NaN,NaN,NaN,NaN,-37.72006,145.10547,Northern Metropolitan,1369.0
18394,23545,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,...,1.0,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0
18395,23546,Yarraville,33 Freeman St,4,h,1050000.0,VB,Village,26/08/2017,6.3,...,2.0,2.0,NaN,139.0,1950.0,NaN,-37.81829,144.87404,Western Metropolitan,6543.0

#### each row of a dataframe is a series

In [3]:
animals_1 = ["tiger", "bear", "moose"]     # python list

series = pd.Series(animals_1)

In [4]:
animals_1

['tiger', 'bear', 'moose']

In [5]:
series

0    tiger
1     bear
2    moose
dtype: object

#### another example

In [6]:
animals = ["tiger", "bear", "moose"]
ages = [20, 25, 8]

serie = pd.Series([animals, ages])
serie

0    [tiger, bear, moose]
1             [20, 25, 8]
dtype: object

#### type of a series

- if all items in a serie are integers ==> dtype: int
- if all items in a serie are float ==> dtype: float
- if all items in a serie are integers and float ==> dtype: float
- if all items in a serie are string ==> dtype: object

In [7]:
ages = [20, 25, 8]

serie = pd.Series(ages)
serie

0    20
1    25
2     8
dtype: int64

In [8]:
weight = [20.5, 25, 8]

serie = pd.Series(weight)
serie

0    20.5
1    25.0
2     8.0
dtype: float64

In [9]:
name = ['a', 'b', 'c', 'D']

serie = pd.Series(name)
serie

0    a
1    b
2    c
3    D
dtype: object

In [10]:
name = ['a', 10, 'c', 'D']

serie = pd.Series(name)
serie

0     a
1    10
2     c
3     D
dtype: object

#### if an item in a serie is None

- if all items in it are integer and float ==> None ==> Nan: not a number
- if the series items contain strings ==> None ==> None

In [11]:
name = ['a', 10, 'c', None]

serie = pd.Series(name)
serie

0       a
1      10
2       c
3    None
dtype: object

In [12]:
name = [5, 15, None]

serie = pd.Series(name)
serie

0     5.0
1    15.0
2     NaN
dtype: float64

## define special index

### with dictionary

In [13]:
animals = {
    'animal_1' : "tiger",
    'animal_2' : "bear",
    'animal_3' : "moose"
}

serie = pd.Series(animals)

serie

animal_1    tiger
animal_2     bear
animal_3    moose
dtype: object

#### indexes and values

In [14]:
print(serie.index)

print(serie.values)

Index(['animal_1', 'animal_2', 'animal_3'], dtype='object')
['tiger' 'bear' 'moose']

### without dictionary

In [15]:
ages = [10, 15, 26, 40]

serie = pd.Series(ages, index = ["first", "second", "third", "fourth"])

serie

first     10
second    15
third     26
fourth    40
dtype: int64

In [16]:
serie = pd.Series([10, 15, 26, 40], index = ["first", "second", "third", "fourth"])

serie

first     10
second    15
third     26
fourth    40
dtype: int64

In [17]:
serie["second"]

15

In [18]:
serie["first"]

10

### .loc

In [19]:
serie.loc[ ["first", "second"] ]

first     10
second    15
dtype: int64

### .iloc

In [20]:
serie.iloc[2:]

third     26
fourth    40
dtype: int64

## combine with numpy methods

In [21]:
import numpy as np

In [22]:
ages = [10, 15, 26, 40]

serie = pd.Series(ages, index = ["n1", "n2", "n3", "n4"])

serie

n1    10
n2    15
n3    26
n4    40
dtype: int64

In [23]:
np.sum(serie)

91

In [24]:
np.mean(serie)

22.75

## dataframe

In [25]:
# keys of all dictionaries should be same

serie_1 = {
    'n1': "tiger",
    'n2': "bear",
    'n3': "moose"
}

serie_2 = {
    'n1': "cat",
    'n2': "fish",
    'n3': "rabbit"
}

serie_3 = {
    'n1': "dog",
    'n2': "pig",
    'n3': "horse"
}

df = pd.DataFrame([serie_1, serie_2, serie_3])

df

      n1    n2      n3
0  tiger  bear   moose
1    cat  fish  rabbit
2    dog   pig   horse

## define special index

In [26]:
# keys of all dictionaries should be same

serie_1 = {
    'n1': "tiger",
    'n2': "bear",
    'n3': "moose"
}

serie_2 = {
    'n1': "cat",
    'n2': "fish",
    'n3': "rabbit"
}

serie_3 = {
    'n1': "dog",
    'n2': "pig",
    'n3': "horse"
}

df = pd.DataFrame([serie_1, serie_2, serie_3], index = ['serie_1', 'serie_2', 'serie_3'])

df

            n1    n2      n3
serie_1  tiger  bear   moose
serie_2    cat  fish  rabbit
serie_3    dog   pig   horse

In [27]:
df.loc['serie_1']

n1    tiger
n2     bear
n3    moose
Name: serie_1, dtype: object

In [28]:
df.loc[["serie_2", "serie_3"]]

          n1    n2      n3
serie_2  cat  fish  rabbit
serie_3  dog   pig   horse

In [29]:
df.iloc[1:]

          n1    n2      n3
serie_2  cat  fish  rabbit
serie_3  dog   pig   horse

In [30]:
df.loc["serie_3"].loc["n2"]

'pig'

In [31]:
df.iloc[1].iloc[0]

'cat'

In [32]:
# df.loc[row, column]
# df.iloc[row, column]

In [33]:
df.loc["serie_1", "n2"]

'bear'

In [34]:
df.iloc[2, 0]

'dog'

### delete row

- .drop( name, axis = 0 )
- .drop( [names], axis = 0 )
- .drop( index = name )
- .drop( index = [names] )

In [86]:
serie_1 = {
    'n1': "tiger",
    'n2': "bear",
    'n3': "moose"
}

serie_2 = {
    'n1': "cat",
    'n2': "fish",
    'n3': "rabbit"
}

serie_3 = {
    'n1': "dog",
    'n2': "pig",
    'n3': "horse"
}

df = pd.DataFrame([serie_1, serie_2, serie_3], index = ['serie_1', 'serie_2', 'serie_3'])

df

            n1    n2      n3
serie_1  tiger  bear   moose
serie_2    cat  fish  rabbit
serie_3    dog   pig   horse

In [67]:
df_2 = df.drop('serie_1', axis = 0)

df_2

          n1    n2      n3
serie_2  cat  fish  rabbit
serie_3  dog   pig   horse

In [69]:
df_2 = df.drop(['serie_1', 'serie_3'], axis = 0)

df_2

          n1    n2      n3
serie_2  cat  fish  rabbit

In [60]:
df_2 = df.drop(index = ['serie_1', 'serie_3'])

df_2

          n1    n2      n3
serie_2  cat  fish  rabbit

In [87]:
# inplace drop: changes the original df

df.drop('serie_1', axis = 0, inplace = True)
df

          n1    n2      n3
serie_2  cat  fish  rabbit
serie_3  dog   pig   horse

### delete column

In [91]:
serie_1 = {
    'n1': "tiger",
    'n2': "bear",
    'n3': "moose"
}

serie_2 = {
    'n1': "cat",
    'n2': "fish",
    'n3': "rabbit"
}

serie_3 = {
    'n1': "dog",
    'n2': "pig",
    'n3': "horse"
}

df = pd.DataFrame([serie_1, serie_2, serie_3], index = ['serie_1', 'serie_2', 'serie_3'])

df

            n1    n2      n3
serie_1  tiger  bear   moose
serie_2    cat  fish  rabbit
serie_3    dog   pig   horse

In [71]:
df.drop('n2', axis = 1)

            n1      n3
serie_1  tiger   moose
serie_2    cat  rabbit
serie_3    dog   horse

In [73]:
df.drop(['n1', 'n2'], axis = 1)

             n3
serie_2  rabbit
serie_3   horse

In [79]:
df.drop(columns = 'n3')

            n1    n2
serie_1  tiger  bear
serie_2    cat  fish
serie_3    dog   pig

In [80]:
df.drop(columns = ['n1', 'n3'])

           n2
serie_1  bear
serie_2  fish
serie_3   pig

In [92]:
# inplace drop: changes the original df

df.drop('n2', axis = 1, inplace = True)

df

            n1      n3
serie_1  tiger   moose
serie_2    cat  rabbit
serie_3    dog   horse